---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.Undefined
enum: Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult
source: html/7f028cdc-ad5f-a349-b3e7-8c7d2e65ded0.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.Undefined

Failed because the map contained no entries.